Autodesk.Revit.DB.AnnotationMultipleAlignmentUtils.GetAnnotationCenter(Autodesk.Revit.DB.Element)
Gets the center of the alignable element in model space.
element:
The element for which we are retrieving the center.
Returns:
The center point of the alignable element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element element does not support multiple alignment behavior.
-or-
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025